nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/usb/processor/usb_p32mx274f256d.h
PLIB_INLINE_API bool PLIB_USB_ErrorInterruptFlagGet(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
     return USB_ErrorInterruptFlagGet_Default(index, interruptFlag);
}

PLIB_INLINE_API USB_ERROR_INTERRUPTS PLIB_USB_ErrorInterruptFlagAllGet(USB_MODULE_ID index)
{
     return USB_ErrorInterruptFlagAllGet_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsERR_InterruptStatus(USB_MODULE_ID index)
{
     return USB_ExistsERR_InterruptStatus_Default(index);
}

PLIB_INLINE_API void PLIB_USB_ErrorInterruptEnable(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
     USB_ErrorInterruptEnable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_USB_ErrorInterruptDisable(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
     USB_ErrorInterruptDisable_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_ErrorInterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
     return USB_ErrorInterruptIsEnabled_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_ExistsERR_Interrupt(USB_MODULE_ID index)
{
     return USB_ExistsERR_Interrupt_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_USB_LastTransactionEndPtGet(USB_MODULE_ID index)
{
     return USB_LastTransactionEndPtGet_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsLastEndpoint(USB_MODULE_ID index)
{
     return USB_ExistsLastEndpoint_Default(index);
}

PLIB_INLINE_API USB_BUFFER_DIRECTION PLIB_USB_LastTransactionDirectionGet(USB_MODULE_ID index)
{
     return USB_LastTransactionDirectionGet_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsLastDirection(USB_MODULE_ID index)
{
     return USB_ExistsLastDirection_Default(index);
}

PLIB_INLINE_API USB_PING_PONG_STATE PLIB_USB_LastTransactionPingPongStateGet(USB_MODULE_ID index)
{
     return USB_LastTransactionPingPongStateGet_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsLastPingPong(USB_MODULE_ID index)
{
     return USB_ExistsLastPingPong_Default(index);
}

PLIB_INLINE_API void PLIB_USB_LastTransactionDetailsGet(USB_MODULE_ID index, USB_BUFFER_DIRECTION* direction, USB_PING_PONG_STATE* pingpong, uint8_t* endpoint)
{
     USB_LastTransactionDetailsGet_Default(index, direction, pingpong, endpoint);
}

PLIB_INLINE_API bool PLIB_USB_ExistsLastTransactionDetails(USB_MODULE_ID index)
{
     return USB_ExistsLastTransactionDetails_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_JStateIsActive(USB_MODULE_ID index)
{
     return USB_JStateIsActive_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsLiveJState(USB_MODULE_ID index)
{
     return USB_ExistsLiveJState_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_SE0InProgress(USB_MODULE_ID index)
{
     return USB_SE0InProgress_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsLiveSingleEndedZero(USB_MODULE_ID index)
{
     return USB_ExistsLiveSingleEndedZero_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_PacketTransferIsDisabled(USB_MODULE_ID index)
{
     return USB_PacketTransferIsDisabled_Default(index);
}

PLIB_INLINE_API void PLIB_USB_PacketTransferEnable(USB_MODULE_ID index)
{
     USB_PacketTransferEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_PacketTransferDisable(USB_MODULE_ID index)
{
     USB_PacketTransferDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsPacketTransfer(USB_MODULE_ID index)
{
     return USB_ExistsPacketTransfer_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_IsBusyWithToken(USB_MODULE_ID index)
{
     return USB_IsBusyWithToken_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsHostBusyWithToken(USB_MODULE_ID index)
{
     return USB_ExistsHostBusyWithToken_Default(index);
}

PLIB_INLINE_API void PLIB_USB_ResetSignalEnable(USB_MODULE_ID index)
{
     USB_ResetSignalEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_ResetSignalDisable(USB_MODULE_ID index)
{
     USB_ResetSignalDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsHostGeneratesReset(USB_MODULE_ID index)
{
     return USB_ExistsHostGeneratesReset_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OperatingModeSelect(USB_MODULE_ID index, USB_OPMODES opMode)
{
     USB_OperatingModeSelect_Default(index, opMode);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOpModeSelect(USB_MODULE_ID index)
{
     return USB_ExistsOpModeSelect_Default(index);
}

PLIB_INLINE_API void PLIB_USB_ResumeSignalingEnable(USB_MODULE_ID index)
{
     USB_ResumeSignalingEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_ResumeSignalingDisable(USB_MODULE_ID index)
{
     USB_ResumeSignalingDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsResumeSignaling(USB_MODULE_ID index)
{
     return USB_ExistsResumeSignaling_Default(index);
}

PLIB_INLINE_API void PLIB_USB_PingPongFreeze(USB_MODULE_ID index)
{
     USB_PingPongFreeze_Default(index);
}

PLIB_INLINE_API void PLIB_USB_PingPongUnfreeze(USB_MODULE_ID index)
{
     USB_PingPongUnfreeze_Default(index);
}

PLIB_INLINE_API void PLIB_USB_PingPongReset(USB_MODULE_ID index)
{
     USB_PingPongReset_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsBufferFreeze(USB_MODULE_ID index)
{
     return USB_ExistsBufferFreeze_Default(index);
}

PLIB_INLINE_API void PLIB_USB_SOFEnable(USB_MODULE_ID index)
{
     USB_SOFEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_SOFDisable(USB_MODULE_ID index)
{
     USB_SOFDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsStartOfFrames(USB_MODULE_ID index)
{
     return USB_ExistsStartOfFrames_Default(index);
}

PLIB_INLINE_API void PLIB_USB_TokenSpeedSelect(USB_MODULE_ID index, USB_TOKEN_SPEED tokenSpeed)
{
     USB_TokenSpeedSelect_Default(index, tokenSpeed);
}

PLIB_INLINE_API bool PLIB_USB_ExistsNextTokenSpeed(USB_MODULE_ID index)
{
     return USB_ExistsNextTokenSpeed_Default(index);
}

PLIB_INLINE_API void PLIB_USB_DeviceAddressSet(USB_MODULE_ID index, uint8_t address)
{
     USB_DeviceAddressSet_Default(index, address);
}

PLIB_INLINE_API uint8_t PLIB_USB_DeviceAddressGet(USB_MODULE_ID index)
{
     return USB_DeviceAddressGet_Default(index);
}

